{
  "overall_comment": "あなたの顔の特徴と全体的な外見に基づいて、自然で上品で多用途なスタイルの基盤を持っています。バランスの取れた顔のプロポーションと温かみのある肌色により、様々なスタイリングアプローチの素晴らしい機会が生まれます。髪型、メイク、ファッションの正しい選択により、自然な美しさを引き出し、ユニークな個性を効果的に表現できます。",
  "face_analysis": {
    "face_shape": "オーバル",
    "balance_comment": "あなたの顔は調和の取れたオーバル型で、バランスの良いプロポーションを持っています。額と顎のラインが完璧な対称性を保ち、様々なスタイリングオプションのための上品で多用途な基盤を作り出しています。",
    "strengths": "完璧なオーバル型、バランスの取れたプロポーション、多用途なスタイリングの可能性",
    "improvements": "より明確な頬骨の定義を追加することを検討して、顔の構造を強化する"
  },
  "skin_analysis": {
    "skin_tone": "ウォーム",
    "skin_type": "コンビネーション",
    "skin_comment": "美しいウォームアンダートーンとコンビネーション肌をお持ちです。肌は良好な弾力性と健康的な輝きを示し、Tゾーンの軽い脂性は適切なスキンケアで管理できます。",
    "skin_issues": "Tゾーンの軽い脂性、頬の時々の乾燥",
    "care_routine": "1日2回優しいクレンザーを使用し、軽量のモイスチャライザーを塗布し、オイルフリーの日焼け止めを使用する",
    "product_recommendations": "コンビネーション肌に適したヒアルロン酸とナイアシンアミドを含む製品を探す",
    "recommended_colors": "ウォームアーストーン、ゴールデンイエロー、リッチオレンジ、ウォームブラウンがあなたの肌色を美しく引き立てます"
  },
  "hair_analysis": {
    "hair_comment": "あなたの髪質と顔型はよく調和しています。自然な特徴を引き出すために、ソフトなレイヤーでミディアムレングスのスタイルを検討してください。サイドにボリュームを加えすぎるスタイルは避けてください。",
    "recommended_styles": "顔を縁取るレイヤー付きロブカット、ソフトウェーブ、またはテクスチャードボブ",
    "styling_tips": "動きを加えるためにテクスチャリング製品を使用し、顔を長く見せすぎるストレートスタイルは避ける",
    "maintenance_tips": "6-8週間ごとの定期的なトリミング、スタイリング時の熱保護剤の使用、次元感のためのサブトルバレージの検討",
    "beard_advice": "顔の毛をよく整え、軽いひげやきれいに剃った状態を検討する"
  },
  "eyebrow_analysis": {
    "eyebrow_shape": "ナチュラルアーチ",
    "eyebrow_comment": "あなたの眉毛は良いナチュラルアーチと厚みを持っています。目をよく縁取っていますが、より明確な定義とリフトを作るために軽いシェイピングが役立つでしょう。",
    "styling_tips": "ナチュラルアーチを維持し、よりリフトした外観のためにテールを少し延長する",
    "maintenance_tips": "アーチの下の迷い毛を抜き、クリアな眉ジェルで毛を整え、4-6週間ごとのプロのシェイピングを検討する",
    "styling_recommendations": "ナチュラルアーチを強化し、より良い定義を作るためのプロのシェイピングを検討する"
  },
  "fashion_analysis": {
    "fashion_comment": "あなたのウォーム肌色とオーバル顔型により、ファッション選択において素晴らしい多様性があります。自然な上品さを引き出し、縦のラインを作るピースに焦点を当ててください。",
    "styling_recommendations": "Vネックトップ、構造化されたブレザー、ハイウエストボトム、縦の興味を加えるアクセサリー",
    "recommended_colors": "ウォームニュートラル、ディープバーガンディ、フォレストグリーン、リッチネイビーがあなたの色合いを美しく引き立てます",
    "glasses_recommendations": "微妙なディテールのオーバルまたは長方形フレーム、過度に丸いまたは四角いフレームは避ける",
    "accessory_recommendations": "あなたの洗練されたスタイルに合う繊細なネックレス、ステートメントイヤリング、構造化されたハンドバッグ"
  },
  "lifestyle_advice": {
    "general_advice": "あなたの全体的な外見はバランスの取れたライフスタイルを示唆しています。肌を輝かせ、目の周りのむくみを減らすために、良い睡眠習慣を維持し、水分補給に集中してください。",
    "sleep_advice": "質の良い睡眠を7-8時間目指し、髪の毛の損傷を防ぐためにシルクの枕カバーを使用する",
    "diet_advice": "1日8杯の水で水分補給を保ち、ベリーや緑の葉野菜などの抗酸化物質豊富な食品を含める",
    "exercise_advice": "定期的な有酸素運動と顔のエクササイズは肌の弾力性を維持し、ストレス関連の吹き出物を減らすのに役立ちます"
  }
}
